package homework2;

public class Array2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
//		1. 지불할 금액을 정수로 입력 받아 화폐단위가 각각 몇 개씩 필요한지 출력하는 프로그램을 작성하시오. 
//		입력은 최소 10만원 단위로 입력, 화폐단위는 50000, 10000, 5000, 1000, 500, 100, 50, 10, 5, 1 10
//		가지이며, 가능한 큰 화폐단위로 지불, 입력이 236,873이면 50000원권 4매, 10000원권 3매, 5000원권 1매, 
//		1000원권 1매, 500원 1매, 100원권 3매, 50원권 1매, 10원권 2매, 5원권 0매, 1원권 3개로 출력하라. 
//		단 화폐단위는 배열에 저장한다.
		
		
		
		
//		2. 임의의 수자를 입력하여 369게임을 간단하게 작성. 1-99까지 정수를 입력하고 3,6,9 중 하나가 있는 경우 
//		‘박수짝’을 출력하고, 두 개 있는 경우 ‘박수짝짝’을 출력하는 프로그램을 작성하라. 
		
		
		
		
		
//		3. 다음 그림과 같이 위쪽과 왼쪽 숫자를 곱한 곱셈표를 출력하는 프로그램을 작성하시오.
		
		
		
		
//		4. 소문자 알파벳을 하나 입력받아서 다음과 같은 결과가 나타나도록 코드를 작성하시오.
		
		
		
		
//		5. 크기가 10인 배열을 작성하고 Math.random()함수를 사용하여 1~100사이의 숫자를 랜덤하게 생성하고 
//		생성된 숫자가 3의 배수인 것만 배열에 저장하는 프로그램을 작성하라. 
//		(단 배열의 각 요소는 서로 다른 값만 저장되도록 한다.) 
		
		
		
//		6. 배열을 사용하여 다음의 숫자를 정렬하라. 정렬방법은 선택정렬, 삽입정렬, 버블정렬을 수행하라.
		
		
		
		
//		7. 아래의 그림과 같이 출력되는 프로그램을 작성하시오.
		
	}

}
